testing/load/artillery.config.yml
# Artillery Configuration
# Configuración global para tests de carga

config:
  # Target base URL
  target: '{{ $processEnvironment.TARGET_URL || "http://localhost:3001" }}'
  
  # Phases configuration
  phases:
    - name: 'Warm up'
      duration: 60
      arrivalRate: 5
    
    - name: 'Ramp up'
      duration: 120
      arrivalRate: 5
      rampTo: 50
    
    - name: 'Sustained load'
      duration: 300
      arrivalRate: 50
    
    - name: 'Peak load'
      duration: 60
      arrivalRate: 100
    
    - name: 'Cool down'
      duration: 60
      arrivalRate: 5

  # Default headers
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'

  # Plugins
  plugins:
    ensure:
      thresholds:
        - http.response_time.p95: 500
        - http.response_time.p99: 1000
        - http.requests.rate: 10
    
    metrics-by-endpoint:
      useOnlyRequestNames: true
    
    publish-metrics:
      - type: prometheus
        host: '{{ $processEnvironment.PROMETHEUS_HOST || "localhost" }}'
        port: 9090
        prefix: 'artillery_'

  # Variables
  variables:
    productId:
      - '550e8400-e29b-41d4-a716-446655440001'
      - '550e8400-e29b-41d4-a716-446655440002'
      - '550e8400-e29b-41d4-a716-446655440003'
    
    category:
      - 'electronics'
      - 'clothing'
      - 'home'
      - 'sports'

# Scenarios
scenarios:
  - name: 'Browse Products'
    weight: 60
    flow:
      - get:
          url: '/api/v1/products'
          qs:
            page: 1
            limit: 20
          capture:
            - json: '$.products[0].id'
              as: 'firstProductId'
      
      - think: 2
      
      - get:
          url: '/api/v1/products/{{ firstProductId }}'
      
      - think: 3
      
      - get:
          url: '/api/v1/products'
          qs:
            category: '{{ category }}'
            page: 1
            limit: 10

  - name: 'Search Products'
    weight: 20
    flow:
      - get:
          url: '/api/v1/products'
          qs:
            search: 'laptop'
            page: 1
            limit: 10

  - name: 'View Product Details'
    weight: 15
    flow:
      - get:
          url: '/api/v1/products/{{ productId }}'
      
      - think: 5
      
      - get:
          url: '/api/v1/products/{{ productId }}/stock'

  - name: 'Health Check'
    weight: 5
    flow:
      - get:
          url: '/health'